# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here

temp=pd.read_csv("Temp_States.csv")

#### Print `temp`.

In [3]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [5]:
"""
your comments here

We have strings (city and state) and float(temperature)
"""

'\nyour comments here\n\nWe have strings (city and state) and float(temperature)\n'

#### Select the rows where state is New York.

In [49]:
# your code here
temp[temp["State"]=="New York"]

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [52]:
# your code here
print((temp[temp["State"]=="New York"]).mean())

Temperature    10.740741
dtype: float64

/var/folders/j7/4yrzqvzn643dv0t5y434hfhw0000gn/T/ipykernel_53402/2332822516.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print((temp[temp["State"]=="New York"]).mean())

#### Which states and cities have a temperature above 15 degrees Celsius?

In [53]:
# your code here
temp[temp["Temperature"]>15.0]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [55]:
# your code here
temp[temp["Temperature"]>15.0]["City"]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [57]:
# your code here
condition=(temp["Temperature"]>15.0)&(temp["Temperature"]<20.0)
temp[condition]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [58]:
# your code here
temp.pivot_table(index=['State'], values=['Temperature'], aggfunc=['mean', 'std'])

                   mean         std
            Temperature Temperature
State
Connecticut   15.833333    1.964186
New Jersey    21.111111    1.571348
New York      10.740741    8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [60]:
# your code here
employees=pd.read_csv("Employee.csv")

#### Explore the data types of the `employees` dataframe. Comment your results.

In [61]:
# your code here
employees.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

In [14]:
"""
your comments here
"""

'\nyour comments here\n'

#### What's the average salary in this company?

In [62]:
# your code here
employees["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [63]:
# your code here
employees["Salary"].max()

70

#### What's the lowest salary?

In [64]:
# your code here
employees["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [66]:
# your code here
employees.sort_values(by='Salary', ascending=True)

     Name Department Education Gender      Title  Years  Salary
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
0    Jose         IT  Bachelor      M    analyst      1      35
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60
6  Carlos         IT    Master      M         VP      8      70
8     Ana         HR    Master      F         VP      8      70

#### Find all the information about an employee called David.

In [67]:
# your code here
employees[employees["Name"]=="David"]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [68]:
# your code here
condition=employees["Name"]=="David"

employees[condition]["Salary"]

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [70]:
# your code here
employees[employees["Title"]=="associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [71]:
# Method 1
# your code here

employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [23]:
# Method 2
# your code here

#### Find the employees whose title is associate and whose salary is above 55.

In [72]:
# your code here
condition=(employees["Title"]=="associate")&(employees["Salary"]>55)
employees[condition]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [73]:
# your code here
employees.groupby("Years").agg({"Salary":"mean"})

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [74]:
# your code here
employees.groupby("Title").agg({"Salary":"mean"})

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [78]:
# your code here
employees["Salary"].describe()

count     9.000000
mean     48.888889
std      16.541194
min      30.000000
25%      35.000000
50%      55.000000
75%      60.000000
max      70.000000
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [76]:
# your code here
employees.groupby("Gender").agg({"Salary":"mean"})

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [77]:
# your code here
employees.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [30]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [31]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [32]:
# your code here

In [33]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

In [34]:
# your code here

#### What are the highest and lowest purchase prices?

In [35]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [36]:
# your code here

#### How many customers do we have in Spain?

In [37]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [38]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [39]:
# your code here

#### Select all free orders.

In [40]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [41]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [42]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [43]:
# your code here

#### Select all orders made in the month of August.

In [44]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [45]:
# your code here

#### What's the  average amount of money spent by country?

In [46]:
# your code here

#### What's the most expensive item?

In [47]:
# your code here

#### What is the average amount spent per year?

In [48]:
# your code here